; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v8 ?v6)
             (pred_1 ?v7 ?v4)
             (pred_2 ?v8 ?v4)
             (pred_12 ?v11 ?v8 )
	     (pred_10 ?v8)
             (pred_4 ?v13)
             (pred_7 ?v7)
             (pred_6 ?v4)
             (pred_8 ?v8)
             (pred_5 ?v7)
             (pred_9 ?v8)
             (pred_11 ))



(:action op_3
:parameters (?v9 ?v2 ?v3 ?v12)
:precondition (and (pred_4 ?v9) (pred_4 ?v2) (pred_7 ?v3) (pred_6 ?v12)
          (pred_3 ?v9 ?v2) (pred_1 ?v3 ?v12)
                   (pred_2 ?v2 ?v12) (pred_10 ?v9) 
                   (pred_8 ?v2) (pred_5 ?v3))
:effect (and  (pred_9 ?v2) (not (pred_8 ?v2))))


(:action op_1
:parameters (?v9 ?v1)
:precondition (and (pred_4 ?v9) (pred_4 ?v1)
               (pred_10 ?v9) (pred_3 ?v9 ?v1) (pred_9 ?v1))
:effect (and (pred_10 ?v1) (not (pred_10 ?v9))))

(:action op_2
:parameters (?v9 ?v3)
:precondition (and (pred_4 ?v9) (pred_7 ?v3) 
                  (pred_10 ?v9) (pred_12 ?v3 ?v9) (pred_11 ))
:effect (and (pred_5 ?v3)
   (not (pred_12 ?v3 ?v9)) (not (pred_11 ))))


(:action op_4
:parameters (?v9 ?v10 ?v5)
:precondition (and (pred_4 ?v9) (pred_7 ?v10) (pred_7 ?v5)
                  (pred_10 ?v9) (pred_5 ?v5) (pred_12 ?v10 ?v9))
:effect (and (pred_5 ?v10) (pred_12 ?v5 ?v9)
        (not (pred_5 ?v5)) (not (pred_12 ?v10 ?v9))))

(:action op_5
:parameters (?v9 ?v3)
:precondition (and (pred_4 ?v9) (pred_7 ?v3) 
                  (pred_10 ?v9) (pred_5 ?v3))
:effect (and (pred_11 ) (pred_12 ?v3 ?v9) (not (pred_5 ?v3)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_05 obj_19 obj_12 obj_16 obj_06 obj_11 obj_17 obj_04 obj_14 obj_02 obj_07 obj_18 obj_09 obj_08 obj_03 obj_15
    obj_13 obj_01
    obj_10 obj_20
    )

    (:init
       (pred_11)

       (pred_4 obj_05)
       (pred_4 obj_19)
       (pred_4 obj_12)
       (pred_4 obj_16)
       (pred_4 obj_06)
       (pred_4 obj_11)
       (pred_4 obj_17)
       (pred_4 obj_04)
       (pred_4 obj_14)
       (pred_4 obj_02)
       (pred_4 obj_07)
       (pred_4 obj_18)
       (pred_4 obj_09)
       (pred_4 obj_08)
       (pred_4 obj_03)
       (pred_4 obj_15)
       (pred_6 obj_13)
       (pred_6 obj_01)
       (pred_7 obj_10)
       (pred_7 obj_20)

       (pred_3 obj_05 obj_06)
       (pred_3 obj_05 obj_19)
       (pred_3 obj_19 obj_11)
       (pred_3 obj_19 obj_12)
       (pred_3 obj_19 obj_05)
       (pred_3 obj_12 obj_17)
       (pred_3 obj_12 obj_16)
       (pred_3 obj_12 obj_19)
       (pred_3 obj_16 obj_04)
       (pred_3 obj_16 obj_12)
       (pred_3 obj_06 obj_14)
       (pred_3 obj_06 obj_11)
       (pred_3 obj_06 obj_05)
       (pred_3 obj_11 obj_02)
       (pred_3 obj_11 obj_17)
       (pred_3 obj_11 obj_19)
       (pred_3 obj_11 obj_06)
       (pred_3 obj_17 obj_07)
       (pred_3 obj_17 obj_04)
       (pred_3 obj_17 obj_12)
       (pred_3 obj_17 obj_11)
       (pred_3 obj_04 obj_18)
       (pred_3 obj_04 obj_16)
       (pred_3 obj_04 obj_17)
       (pred_3 obj_14 obj_09)
       (pred_3 obj_14 obj_02)
       (pred_3 obj_14 obj_06)
       (pred_3 obj_02 obj_08)
       (pred_3 obj_02 obj_07)
       (pred_3 obj_02 obj_11)
       (pred_3 obj_02 obj_14)
       (pred_3 obj_07 obj_03)
       (pred_3 obj_07 obj_18)
       (pred_3 obj_07 obj_17)
       (pred_3 obj_07 obj_02)
       (pred_3 obj_18 obj_15)
       (pred_3 obj_18 obj_04)
       (pred_3 obj_18 obj_07)
       (pred_3 obj_09 obj_08)
       (pred_3 obj_09 obj_14)
       (pred_3 obj_08 obj_03)
       (pred_3 obj_08 obj_02)
       (pred_3 obj_08 obj_09)
       (pred_3 obj_03 obj_15)
       (pred_3 obj_03 obj_07)
       (pred_3 obj_03 obj_08)
       (pred_3 obj_15 obj_18)
       (pred_3 obj_15 obj_03)
       (pred_8 obj_07)
       (pred_8 obj_05)
       (pred_2  obj_07 obj_13)
       (pred_2  obj_05 obj_01)
       (pred_9 obj_19)
       (pred_9 obj_12)
       (pred_9 obj_16)
       (pred_9 obj_06)
       (pred_9 obj_11)
       (pred_9 obj_17)
       (pred_9 obj_04)
       (pred_9 obj_14)
       (pred_9 obj_02)
       (pred_9 obj_18)
       (pred_9 obj_09)
       (pred_9 obj_08)
       (pred_9 obj_03)
       (pred_9 obj_15)

       (pred_1  obj_10 obj_13)
       (pred_1  obj_20 obj_01)
       (pred_12 obj_10 obj_03)
       (pred_12 obj_20 obj_17)
       (pred_10 obj_15)
    )

    (:goal (and
       (pred_12 obj_20 obj_06)
    ))
(:constraints
  (always (not (pred_10 obj_11)))
)
)

; plan
1. (op_1 obj_15 obj_18)
   deleted: (pred_10 obj_15)
   added: (pred_10 obj_18)
   goals met: 0 of 1
2. (op_1 obj_18 obj_04)
   deleted: (pred_10 obj_18)
   added: (pred_10 obj_04)
   goals met: 0 of 1
3. (op_1 obj_04 obj_17)
   deleted: (pred_10 obj_04)
   added: (pred_10 obj_17)
   goals met: 0 of 1
4. (op_2 obj_17 obj_20)
   deleted: (pred_12 obj_20 obj_17) (pred_11)
   added: (pred_5 obj_20)
   goals met: 0 of 1
5. (op_1 obj_17 obj_12)
   deleted: (pred_10 obj_17)
   added: (pred_10 obj_12)
   goals met: 0 of 1
6. (op_1 obj_12 obj_19)
   deleted: (pred_10 obj_12)
   added: (pred_10 obj_19)
   goals met: 0 of 1
7. (op_3 obj_19 obj_05 obj_20 obj_01)
   deleted: (pred_8 obj_05)
   added: (pred_9 obj_05)
   goals met: 0 of 1
8. (op_1 obj_19 obj_05)
   deleted: (pred_10 obj_19)
   added: (pred_10 obj_05)
   goals met: 0 of 1
9. (op_1 obj_05 obj_06)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_06)
   goals met: 0 of 1
10. (op_5 obj_06 obj_20)
   deleted: (pred_5 obj_20)
   added: (pred_11) (pred_12 obj_20 obj_06)
   goals met: 1 of 1
